config/cf/InformationRegisters/СтепеньГотовностиСообщенийОбменМобильноеПриложение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СтепеньГотовностиСообщенийОбменМобильноеПриложение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентГотовности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СообщенияОбменаМобильноеПриложение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/InformationRegisters/СтепеньГотовностиСообщенийОбменМобильноеПриложение/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура УстановитьПроцентГотовности(Знач Сообщение, Знач Процент) Экспорт
	
	МенеджерЗаписиГотовности = РегистрыСведений.СтепеньГотовностиСообщенийОбменМобильноеПриложение.СоздатьМенеджерЗаписи();
	МенеджерЗаписиГотовности.Сообщение         = Сообщение;
	МенеджерЗаписиГотовности.ПроцентГотовности = Процент;
	МенеджерЗаписиГотовности.Записать();
	
КонецПроцедуры

Функция ПолучитьПроцентГотовностиСообщения(Знач Сообщение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтепеньГотовностиСообщенийОбменМобильноеПриложение.ПроцентГотовности
		|ИЗ
		|	РегистрСведений.СтепеньГотовностиСообщенийОбменМобильноеПриложение КАК СтепеньГотовностиСообщенийОбменМобильноеПриложение
		|ГДЕ
		|	СтепеньГотовностиСообщенийОбменМобильноеПриложение.Сообщение = &Сообщение";
	Запрос.УстановитьПараметр("Сообщение", Сообщение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПроцентГотовности;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти
